apache/nuttx/arch/xtensa/src/esp32/esp32_psram.c
/****************************************************************************
 * arch/xtensa/src/esp32/esp32_psram.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <strings.h>
#include <assert.h>

#include <nuttx/debug.h>
#include <nuttx/config.h>
#include <nuttx/signal.h>

#include "xtensa.h"

#include "espressif/esp_rtc.h"
#include "esp_gpio.h"
#include "esp32_psram.h"
#include "hardware/esp32_spi.h"
#include "hardware/esp32_dport.h"
#include "hardware/esp32_iomux.h"
#include "soc/rtc_cntl_reg.h"
#include "hardware/esp32_gpio_sigmap.h"

#include "rom/esp32_efuse.h"
#include "rom/esp32_spiflash.h"

#ifdef CONFIG_ESP32_SPIRAM

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define RTC_VDDSDIO_TIEH_1_8V      0  /* TIEH field value for 1.8V VDDSDIO */
#define RTC_VDDSDIO_TIEH_3_3V      1  /* TIEH field value for 3.3V VDDSDIO */

/* Commands for PSRAM chip */

#define PSRAM_READ                 0x03
#define PSRAM_FAST_READ            0x0b
#define PSRAM_FAST_READ_DUMMY      0x03
#define PSRAM_FAST_READ_QUAD       0xeb
#define PSRAM_FAST_READ_QUAD_DUMMY 0x05
#define PSRAM_WRITE                0x02
#define PSRAM_QUAD_WRITE           0x38
#define PSRAM_ENTER_QMODE          0x35
#define PSRAM_EXIT_QMODE           0xf5
#define PSRAM_RESET_EN             0x66
#define PSRAM_RESET                0x99
#define PSRAM_SET_BURST_LEN        0xc0
#define PSRAM_DEVICE_ID            0x9f

#define PSRAM_ID_KGD_M             0xff
#define PSRAM_ID_KGD_S             8
#define PSRAM_ID_KGD               0x5d
#define PSRAM_ID_EID_M             0xff
#define PSRAM_ID_EID_S             16

/* Use the [7:5](bit7~bit5) of EID to distinguish the psram size:
 *
 *   BIT7  |  BIT6  |  BIT5  |  SIZE(MBIT)
 *   -------------------------------------
 *    0    |   0    |   0    |     16
 *    0    |   0    |   1    |     32
 *    0    |   1    |   0    |     64
 */

#define PSRAM_EID_SIZE_M           0x07
#define PSRAM_EID_SIZE_S           5

#define PSRAM_KGD(id)         (((id) >> PSRAM_ID_KGD_S) & PSRAM_ID_KGD_M)
#define PSRAM_EID(id)         (((id) >> PSRAM_ID_EID_S) & PSRAM_ID_EID_M)
#define PSRAM_SIZE_ID(id)     ((PSRAM_EID(id) >> PSRAM_EID_SIZE_S) & PSRAM_EID_SIZE_M)
#define PSRAM_IS_VALID(id)    (PSRAM_KGD(id) == PSRAM_ID_KGD)

/* For the old version 32Mbit psram, using the special driver */

#define PSRAM_IS_32MBIT_VER0(id)  (PSRAM_EID(id) == 0x20)
#define PSRAM_IS_64MBIT_TRIAL(id) (PSRAM_EID(id) == 0x26)

/* IO-pins for PSRAM.
 * WARNING: PSRAM shares all but the CS and CLK pins with the flash, so these
 * defines hardcode the flash pins as well, making this code incompatible
 * with either a setup that has the flash on non-standard pins or ESP32s with
 * built-in flash.
 */

#define SPI_IOMUX_PIN_NUM_CLK      6
#define SPI_IOMUX_PIN_NUM_CS       11

#define PSRAM_SPIQ_SD0_IO          7
#define PSRAM_SPID_SD1_IO          8
#define PSRAM_SPIWP_SD3_IO         10
#define PSRAM_SPIHD_SD2_IO         9

#define FLASH_HSPI_CLK_IO          14
#define FLASH_HSPI_CS_IO           15
#define PSRAM_HSPI_SPIQ_SD0_IO     12
#define PSRAM_HSPI_SPID_SD1_IO     13
#define PSRAM_HSPI_SPIWP_SD3_IO    2
#define PSRAM_HSPI_SPIHD_SD2_IO    4

/* PSRAM clock and cs IO should be configured based on hardware design.
 * For ESP32-WROVER or ESP32-WROVER-B module, the clock IO is IO17, the CS IO
 * is IO16, they are the default value for these two configs.
 */

#ifndef CONFIG_D0WD_PSRAM_CLK_IO   /* Default is 17 */
#  define CONFIG_D0WD_PSRAM_CLK_IO 17
#endif

#ifndef CONFIG_D0WD_PSRAM_CS_IO    /* Default is 16 */
#  define CONFIG_D0WD_PSRAM_CS_IO  16
#endif

#ifndef CONFIG_D2WD_PSRAM_CLK_IO   /* Default is 9 */
#  define CONFIG_D2WD_PSRAM_CLK_IO 9
#endif

#ifndef CONFIG_D2WD_PSRAM_CS_IO    /* Default is 10 */
#  define CONFIG_D2WD_PSRAM_CS_IO  10
#endif

/* For ESP32-PICO chip, the psram share clock with flash. The flash clock
 * pin is fixed, which is IO6.
 */

#define PICO_PSRAM_CLK_IO          6

#ifndef CONFIG_PICO_PSRAM_CS_IO    /* Default is 10 */
#  define CONFIG_PICO_PSRAM_CS_IO  10
#endif

#ifndef CONFIG_ESP32_SPIRAM_SPIWP_SD3_PIN /* Default is 7 */
#  define CONFIG_ESP32_SPIRAM_SPIWP_SD3_PIN 7
#endif

#define PSRAM_INTERNAL_IO_28       28
#define PSRAM_INTERNAL_IO_29       29
#define PSRAM_IO_MATRIX_DUMMY_40M  ESP_ROM_SPIFLASH_DUMMY_LEN_PLUS_40M
#define PSRAM_IO_MATRIX_DUMMY_80M  ESP_ROM_SPIFLASH_DUMMY_LEN_PLUS_80M

#define _SPI_CACHE_PORT            0
#define _SPI_FLASH_PORT            1
#define _SPI_80M_CLK_DIV           1
#define _SPI_40M_CLK_DIV           2

/* For 4MB PSRAM, we need one more SPI host, select which one to use by
 * kconfig
 */

#ifdef CONFIG_ESP32_SPIRAM_OCCUPY_HSPI_HOST
#  define PSRAM_SPI_MODULE    PERIPH_HSPI_MODULE
#  define PSRAM_SPI_HOST      HSPI_HOST
#  define PSRAM_CLK_SIGNAL    HSPICLK_OUT_IDX
#  define PSRAM_SPI_NUM       PSRAM_SPI_2
#  define PSRAM_SPICLKEN      DPORT_SPI2_CLK_EN
#elif defined CONFIG_ESP32_SPIRAM_OCCUPY_VSPI_HOST
#  define PSRAM_SPI_MODULE    PERIPH_VSPI_MODULE
#  define PSRAM_SPI_HOST      VSPI_HOST
#  define PSRAM_CLK_SIGNAL    VSPICLK_OUT_IDX
#  define PSRAM_SPI_NUM       PSRAM_SPI_3
#  define PSRAM_SPICLKEN      DPORT_SPI3_CLK_EN
#else   /* set to SPI avoid HSPI and VSPI being used */
#  define PSRAM_SPI_MODULE    PERIPH_SPI_MODULE
#  define PSRAM_SPI_HOST      SPI_HOST
#  define PSRAM_CLK_SIGNAL    SPICLK_OUT_IDX
#  define PSRAM_SPI_NUM       PSRAM_SPI_1
#  define PSRAM_SPICLKEN      DPORT_SPI01_CLK_EN
#endif

