apache/nuttx/arch/xtensa/src/esp32/esp32_psram.c
/* Let's to assume SPIFLASH SPEED == SPIRAM SPEED for now */

#if defined(CONFIG_ESP32_SPIRAM_SPEED_40M)
#  define PSRAM_CS_HOLD_TIME 0
#elif defined(CONFIG_ESP32_SPIRAM_SPEED_80M)
#  define PSRAM_CS_HOLD_TIME 1
#else
#  error "FLASH speed can only be equal to or higher than SRAM speed while SRAM is enabled!"
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

typedef enum
{
  PSRAM_CLK_MODE_NORM = 0,    /* Normal SPI mode */
  PSRAM_CLK_MODE_DCLK = 1,    /* 2 clock cycles after CS is high level */
} psram_clk_mode_t;

typedef enum
{
  PSRAM_EID_SIZE_16MBITS = 0,
  PSRAM_EID_SIZE_32MBITS = 1,
  PSRAM_EID_SIZE_64MBITS = 2,
} psram_eid_size_t;

typedef struct
{
  uint8_t flash_clk_io;
  uint8_t flash_cs_io;
  uint8_t psram_clk_io;
  uint8_t psram_cs_io;
  uint8_t psram_spiq_sd0_io;
  uint8_t psram_spid_sd1_io;
  uint8_t psram_spiwp_sd3_io;
  uint8_t psram_spihd_sd2_io;
} psram_io_t;

typedef enum
{
  PSRAM_SPI_1  = 0x1,
  PSRAM_SPI_2,
  PSRAM_SPI_3,
  PSRAM_SPI_MAX ,
} psram_spi_num_t;

typedef enum
{
  PSRAM_CMD_QPI,
  PSRAM_CMD_SPI,
} psram_cmd_mode_t;

typedef struct
{
  uint16_t cmd;                /* Command value */
  uint16_t cmd_bit_len;        /* Command byte length */
  uint32_t *addr;              /* Point to address value */
  uint16_t addr_bit_len;       /* Address byte length */
  uint32_t *tx_data;           /* Point to send data buffer */
  uint16_t tx_data_bit_len;    /* Send data byte length. */
  uint32_t *rx_data;           /* Point to receive data buffer */
  uint16_t rx_data_bit_len;    /* Receive Data byte length. */
  uint32_t dummy_bit_len;
} psram_cmd_t;

/* Structure describing vddsdio configuration. */

/* Note: this struct is also defined on esp32_pm.c */

struct rtc_vddsdio_config_s
{
  uint32_t force : 1;     /* If 1, use configuration from RTC registers;
                           * if 0, use EFUSE/bootstrapping pins.
                           */
  uint32_t enable : 1;    /* Enable VDDSDIO regulator */
  uint32_t tieh  : 1;     /* Select VDDSDIO voltage. One of
                           * RTC_VDDSDIO_TIEH_1_8V, RTC_VDDSDIO_TIEH_3_3V
                           */
  uint32_t drefh : 2;     /* Tuning parameter for VDDSDIO regulator */
  uint32_t drefm : 2;     /* Tuning parameter for VDDSDIO regulator */
  uint32_t drefl : 2;     /* Tuning parameter for VDDSDIO regulator */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static int s_psram_mode = PSRAM_CACHE_MAX;
static psram_clk_mode_t s_clk_mode = PSRAM_CLK_MODE_DCLK;
static uint64_t s_psram_id = 0;
static bool s_2t_mode_enabled = false;
static int extra_dummy = 0;

/****************************************************************************
 * ROM Data
 ****************************************************************************/

/* dummy_len_plus values defined in ROM for SPI flash configuration */

extern uint8_t g_rom_spiflash_dummy_len_plus[];

/****************************************************************************
 * Private Functions Prototypes
 ****************************************************************************/

static int IRAM_ATTR esp32_get_vddsdio_config(
                     struct rtc_vddsdio_config_s *config);

static void IRAM_ATTR
psram_cache_init(int psram_cache_mode,
                 int vaddrmode);

static void psram_clear_spi_fifo(psram_spi_num_t spi_num);

static void psram_set_basic_write_mode(psram_spi_num_t spi_num);

static void psram_set_qio_write_mode(psram_spi_num_t spi_num);

static void psram_set_qio_read_mode(psram_spi_num_t spi_num);

static void psram_set_basic_read_mode(psram_spi_num_t spi_num);

static void IRAM_ATTR
psram_cmd_recv_start(psram_spi_num_t spi_num,
                     uint32_t *data,
                     uint16_t rx_byte_len,
                     psram_cmd_mode_t cmd_mode);

static int psram_cmd_config(psram_spi_num_t spi_num, psram_cmd_t *data);

static void psram_cmd_end(int spi_num);

static void psram_disable_qio_mode(psram_spi_num_t spi_num);

static void psram_read_id(uint64_t *dev_id);

static int IRAM_ATTR
psram_enable_qio_mode(psram_spi_num_t spi_num);

#if defined(CONFIG_ESP32_SPIRAM_2T_MODE)
static void spi_user_psram_write(psram_spi_num_t spi_num, uint32_t address,
                                 uint32_t *data_buffer, uint32_t data_len);

static void spi_user_psram_read(psram_spi_num_t spi_num, uint32_t address,
                                uint32_t *data_buffer, uint32_t data_len);

static int IRAM_ATTR
psram_2t_mode_enable(psram_spi_num_t spi_num);

static int psram_2t_mode_check(psram_spi_num_t spi_num);
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32_get_vddsdio_config
 *
 * Description:
 *   Get current VDDSDIO configuration.
 *
 * Input Parameters:
 *   Incoming parameter address of VDDSDIO configuration to be saved
 *
 * Returned Value:
 *   Zero (OK) is returned on success.
 *
 ****************************************************************************/

static int IRAM_ATTR esp32_get_vddsdio_config(
                     struct rtc_vddsdio_config_s *config)
{
  struct rtc_vddsdio_config_s *result = config;
  uint32_t efuse_reg;
  uint32_t strap_reg;
  uint32_t sdio_conf_reg = getreg32(RTC_CNTL_SDIO_CONF_REG);

  result->drefh = (sdio_conf_reg & RTC_CNTL_DREFH_SDIO_M)
                                 >> RTC_CNTL_DREFH_SDIO_S;
  result->drefm = (sdio_conf_reg & RTC_CNTL_DREFM_SDIO_M)
                                 >> RTC_CNTL_DREFM_SDIO_S;
  result->drefl = (sdio_conf_reg & RTC_CNTL_DREFL_SDIO_M)
                                 >> RTC_CNTL_DREFL_SDIO_S;

