apache/nuttx/arch/xtensa/src/esp32/esp32_psram.c
  regval  = getreg32(DPORT_APP_CACHE_CTRL1_REG);
  regval &= ~(DPORT_APP_CMMU_SRAM_PAGE_MODE <<
              DPORT_APP_CMMU_SRAM_PAGE_MODE_S);
  putreg32(regval, DPORT_APP_CACHE_CTRL1_REG);

  /* ENABLE SPI0 CS1 TO PSRAM(CS0--FLASH; CS1--SRAM) */

  modifyreg32(SPI_PIN_REG(0), SPI_CS1_DIS_M, 0);
}

static void psram_clear_spi_fifo(psram_spi_num_t spi_num)
{
  int i;

  for (i = 0; i < 16; i++)
    {
      putreg32(0, SPI_W0_REG(spi_num) + i * 4);
    }
}

/* set basic SPI write mode */

static void psram_set_basic_write_mode(psram_spi_num_t spi_num)
{
  modifyreg32(SPI_USER_REG(spi_num), SPI_FWRITE_QIO, 0);
  modifyreg32(SPI_USER_REG(spi_num), SPI_FWRITE_DIO, 0);
  modifyreg32(SPI_USER_REG(spi_num), SPI_FWRITE_QUAD, 0);
  modifyreg32(SPI_USER_REG(spi_num), SPI_FWRITE_DUAL, 0);
}

/* set QPI write mode */

static void psram_set_qio_write_mode(psram_spi_num_t spi_num)
{
  modifyreg32(SPI_USER_REG(spi_num), 0, SPI_FWRITE_QIO);
  modifyreg32(SPI_USER_REG(spi_num), SPI_FWRITE_DIO, 0);
  modifyreg32(SPI_USER_REG(spi_num), SPI_FWRITE_QUAD, 0);
  modifyreg32(SPI_USER_REG(spi_num), SPI_FWRITE_DUAL, 0);
}

/* set QPI read mode */

static void psram_set_qio_read_mode(psram_spi_num_t spi_num)
{
  modifyreg32(SPI_CTRL_REG(spi_num), 0, SPI_FREAD_QIO);
  modifyreg32(SPI_CTRL_REG(spi_num), SPI_FREAD_QUAD, 0);
  modifyreg32(SPI_CTRL_REG(spi_num), SPI_FREAD_DUAL, 0);
  modifyreg32(SPI_CTRL_REG(spi_num), SPI_FREAD_DIO, 0);
}

/* set SPI read mode */

static void psram_set_basic_read_mode(psram_spi_num_t spi_num)
{
  modifyreg32(SPI_CTRL_REG(spi_num), SPI_FREAD_QIO, 0);
  modifyreg32(SPI_CTRL_REG(spi_num), SPI_FREAD_QUAD, 0);
  modifyreg32(SPI_CTRL_REG(spi_num), SPI_FREAD_DUAL, 0);
  modifyreg32(SPI_CTRL_REG(spi_num), SPI_FREAD_DIO, 0);
}

/* start sending cmd/addr and optionally, receiving data */

static void IRAM_ATTR
psram_cmd_recv_start(psram_spi_num_t spi_num,
                     uint32_t *data,
                     uint16_t rx_byte_len,
                     psram_cmd_mode_t cmd_mode)
{
  /* Get CS1 */

  modifyreg32(SPI_PIN_REG(PSRAM_SPI_1), SPI_CS1_DIS_M, 0);
  modifyreg32(SPI_PIN_REG(PSRAM_SPI_1), 0, SPI_CS0_DIS_M);

  uint32_t mode_backup = (getreg32(SPI_USER_REG(spi_num)) >>
                          SPI_FWRITE_DUAL_S) & 0xf;

  uint32_t rd_mode_backup = getreg32(SPI_CTRL_REG(spi_num)) &
                            (SPI_FREAD_DIO_M | SPI_FREAD_DUAL_M |
                             SPI_FREAD_QUAD_M | SPI_FREAD_QIO_M);

  if (cmd_mode == PSRAM_CMD_SPI)
    {
      psram_set_basic_write_mode(spi_num);
      psram_set_basic_read_mode(spi_num);
    }
  else
    {
      if (cmd_mode == PSRAM_CMD_QPI)
        {
          psram_set_qio_write_mode(spi_num);
          psram_set_qio_read_mode(spi_num);
        }
    }

  /* Wait for SPI0 to idle */

  while (getreg32(SPI_EXT2_REG(0)) != 0);

#ifndef CONFIG_ESP32_PID
  modifyreg32(DPORT_HOST_INF_SEL_REG, 0, 1 << 14);
#endif

  /* Start send data */

  modifyreg32(SPI_CMD_REG(spi_num), 0, SPI_USR);

  while ((getreg32(SPI_CMD_REG(spi_num)) & SPI_USR));

#ifndef CONFIG_ESP32_PID
  modifyreg32(DPORT_HOST_INF_SEL_REG, 1 << 14, 0);
#endif

  /* recover spi mode */

  SET_PERI_REG_BITS(SPI_USER_REG(spi_num),
                    (data?SPI_FWRITE_DUAL_M:0xf),
                    mode_backup, SPI_FWRITE_DUAL_S);

  modifyreg32(SPI_CTRL_REG(spi_num),
                      (SPI_FREAD_DIO_M | SPI_FREAD_DUAL_M |
                      SPI_FREAD_QUAD_M | SPI_FREAD_QIO_M), 0);

  modifyreg32(SPI_CTRL_REG(spi_num), 0, rd_mode_backup);

  /* return cs to cs0 */

  modifyreg32(SPI_PIN_REG(PSRAM_SPI_1), 0, SPI_CS1_DIS_M);
  modifyreg32(SPI_PIN_REG(PSRAM_SPI_1), SPI_CS0_DIS_M, 0);

  if (data)
    {
      int idx = 0;

      /* Read data out */

      do
        {
          *data++ = getreg32(SPI_W0_REG(spi_num) + (idx << 2));
        }
      while (++idx < ((rx_byte_len / 4) + ((rx_byte_len % 4) ? 1 : 0)));
    }
}

static uint32_t backup_usr[3];
static uint32_t backup_usr1[3];
static uint32_t backup_usr2[3];

/* setup spi command/addr/data/dummy in user mode */

static int psram_cmd_config(psram_spi_num_t spi_num, psram_cmd_t *data)
{
  while (getreg32(SPI_CMD_REG(spi_num)) & SPI_USR);

  backup_usr[spi_num]  = getreg32(SPI_USER_REG(spi_num));
  backup_usr1[spi_num] = getreg32(SPI_USER1_REG(spi_num));
  backup_usr2[spi_num] = getreg32(SPI_USER2_REG(spi_num));

  /* Set command by user. */

  if (data->cmd_bit_len != 0)
    {
      /* Max command length 16 bits. */

      SET_PERI_REG_BITS(SPI_USER2_REG(spi_num),
                        SPI_USR_COMMAND_BITLEN,
                        data->cmd_bit_len - 1,
                        SPI_USR_COMMAND_BITLEN_S);

      /* Enable command */

      modifyreg32(SPI_USER_REG(spi_num), 0, SPI_USR_COMMAND);

      /* Load command,bit15-0 is cmd value. */

      SET_PERI_REG_BITS(SPI_USER2_REG(spi_num),
                        SPI_USR_COMMAND_VALUE,
                        data->cmd,
                        SPI_USR_COMMAND_VALUE_S);
    }
  else
    {
      modifyreg32(SPI_USER_REG(spi_num), SPI_USR_COMMAND, 0);
      SET_PERI_REG_BITS(SPI_USER2_REG(spi_num), SPI_USR_COMMAND_BITLEN,
                        0, SPI_USR_COMMAND_BITLEN_S);
    }

  /* Set Address by user. */

  if (data->addr_bit_len != 0)
    {
      SET_PERI_REG_BITS(SPI_USER1_REG(spi_num), SPI_USR_ADDR_BITLEN,
                        (data->addr_bit_len - 1),
                        SPI_USR_ADDR_BITLEN_S);

      /* Enable address */

      modifyreg32(SPI_USER_REG(spi_num), 0, SPI_USR_ADDR);

      /* Set address */

      putreg32(*data->addr, SPI_ADDR_REG(spi_num));
    }
  else
    {
      modifyreg32(SPI_USER_REG(spi_num), SPI_USR_ADDR, 0);
      SET_PERI_REG_BITS(SPI_USER1_REG(spi_num), SPI_USR_ADDR_BITLEN,
                        0, SPI_USR_ADDR_BITLEN_S);
    }

  /* Set data by user. */

  uint32_t *p_tx_val = data->tx_data;

  if (data->tx_data_bit_len != 0)
    {
      /* Enable MOSI */

      modifyreg32(SPI_USER_REG(spi_num), 0, SPI_USR_MOSI);

      /* Load send buffer */

