apache/nuttx/arch/xtensa/src/esp32/esp32_psram.c
      int len = (data->tx_data_bit_len + 31) / 32;
      if (p_tx_val != NULL)
        {
          memcpy((void *) SPI_W0_REG(spi_num), p_tx_val, len * 4);
        }

      /* Set data send buffer length.Max data length 64 bytes. */

      SET_PERI_REG_BITS(SPI_MOSI_DLEN_REG(spi_num), SPI_USR_MOSI_DBITLEN,
                        (data->tx_data_bit_len - 1),
                        SPI_USR_MOSI_DBITLEN_S);
    }
  else
    {
      modifyreg32(SPI_USER_REG(spi_num), SPI_USR_MOSI, 0);
      SET_PERI_REG_BITS(SPI_MOSI_DLEN_REG(spi_num), SPI_USR_MOSI_DBITLEN,
                        0, SPI_USR_MOSI_DBITLEN_S);
    }

  /* Set rx data by user. */

  if (data->rx_data_bit_len != 0)
    {
      /* Enable MOSI */

      modifyreg32(SPI_USER_REG(spi_num), 0, SPI_USR_MISO);

      /* Set data send buffer length.Max data length 64 bytes. */

      SET_PERI_REG_BITS(SPI_MISO_DLEN_REG(spi_num), SPI_USR_MISO_DBITLEN,
                        (data->rx_data_bit_len - 1),
                        SPI_USR_MISO_DBITLEN_S);
    }
  else
    {
      modifyreg32(SPI_USER_REG(spi_num), SPI_USR_MISO, 0);
      SET_PERI_REG_BITS(SPI_MISO_DLEN_REG(spi_num), SPI_USR_MISO_DBITLEN,
                        0, SPI_USR_MISO_DBITLEN_S);
    }

  if (data->dummy_bit_len != 0)
    {
      modifyreg32(SPI_USER_REG(PSRAM_SPI_1), 0, SPI_USR_DUMMY); /* Dummy EN */
      SET_PERI_REG_BITS(SPI_USER1_REG(PSRAM_SPI_1), SPI_USR_DUMMY_CYCLELEN_V,
                        data->dummy_bit_len - 1,
                        SPI_USR_DUMMY_CYCLELEN_S);  /* DUMMY */
    }
  else
    {
      modifyreg32(SPI_USER_REG(PSRAM_SPI_1), SPI_USR_DUMMY, 0); /* dummy en */
      SET_PERI_REG_BITS(SPI_USER1_REG(PSRAM_SPI_1), SPI_USR_DUMMY_CYCLELEN_V,
                        0, SPI_USR_DUMMY_CYCLELEN_S);  /* DUMMY */
    }

  return 0;
}

static void psram_cmd_end(int spi_num)
{
  while (getreg32(SPI_CMD_REG(spi_num)) & SPI_USR);

  putreg32(backup_usr[spi_num], SPI_USER_REG(spi_num));
  putreg32(backup_usr1[spi_num], SPI_USER1_REG(spi_num));
  putreg32(backup_usr2[spi_num], SPI_USER2_REG(spi_num));
}

/* exit QPI mode(set back to SPI mode) */

static void psram_disable_qio_mode(psram_spi_num_t spi_num)
{
  psram_cmd_t ps_cmd;
  uint32_t cmd_exit_qpi;

  cmd_exit_qpi = PSRAM_EXIT_QMODE;
  ps_cmd.tx_data_bit_len = 8;
  if (s_clk_mode == PSRAM_CLK_MODE_DCLK)
    {
      switch (s_psram_mode)
        {
          case PSRAM_CACHE_F80M_S80M:
            break;
          case PSRAM_CACHE_F80M_S40M:
          case PSRAM_CACHE_F40M_S40M:
          default:
            cmd_exit_qpi = PSRAM_EXIT_QMODE << 8;
            ps_cmd.tx_data_bit_len = 16;
            break;
        }
    }

  ps_cmd.tx_data = &cmd_exit_qpi;
  ps_cmd.cmd = 0;
  ps_cmd.cmd_bit_len = 0;
  ps_cmd.addr = 0;
  ps_cmd.addr_bit_len = 0;
  ps_cmd.rx_data = NULL;
  ps_cmd.rx_data_bit_len = 0;
  ps_cmd.dummy_bit_len = 0;
  psram_cmd_config(spi_num, &ps_cmd);
  psram_cmd_recv_start(spi_num, NULL, 0, PSRAM_CMD_QPI);
  psram_cmd_end(spi_num);
}

/* read psram id */

static void psram_read_id(uint64_t *dev_id)
{
  psram_spi_num_t spi_num = PSRAM_SPI_1;
  psram_disable_qio_mode(spi_num);
  uint32_t dummy_bits = 0 + extra_dummy;
  uint32_t psram_id[2] =
                          {
                            0
                          };

  psram_cmd_t ps_cmd;

  uint32_t addr = 0;
  ps_cmd.addr_bit_len = 3 * 8;
  ps_cmd.cmd = PSRAM_DEVICE_ID;
  ps_cmd.cmd_bit_len = 8;

  if (s_clk_mode == PSRAM_CLK_MODE_DCLK)
    {
      switch (s_psram_mode)
        {
          case PSRAM_CACHE_F80M_S80M:
            break;
          case PSRAM_CACHE_F80M_S40M:
          case PSRAM_CACHE_F40M_S40M:
          default:
            ps_cmd.cmd_bit_len = 2;   /* this 2 bits is used to delay 2 clk cycle */
            ps_cmd.cmd = 0;
            addr = (PSRAM_DEVICE_ID << 24) | 0;
            ps_cmd.addr_bit_len = 4 * 8;
            break;
        }
    }

  ps_cmd.addr = &addr;
  ps_cmd.tx_data_bit_len = 0;
  ps_cmd.tx_data = NULL;
  ps_cmd.rx_data_bit_len = 8 * 8;
  ps_cmd.rx_data = psram_id;
  ps_cmd.dummy_bit_len = dummy_bits;

  psram_cmd_config(spi_num, &ps_cmd);
  psram_clear_spi_fifo(spi_num);
  psram_cmd_recv_start(spi_num, ps_cmd.rx_data,
                       ps_cmd.rx_data_bit_len / 8, PSRAM_CMD_SPI);
  psram_cmd_end(spi_num);
  *dev_id = (((uint64_t)psram_id[1] << 32) | psram_id[0]);
}

/* enter QPI mode */

static int IRAM_ATTR
psram_enable_qio_mode(psram_spi_num_t spi_num)
{
  psram_cmd_t ps_cmd;
  uint32_t addr = (PSRAM_ENTER_QMODE << 24) | 0;

  ps_cmd.cmd_bit_len = 0;

  if (s_clk_mode == PSRAM_CLK_MODE_DCLK)
    {
      switch (s_psram_mode)
        {
          case PSRAM_CACHE_F80M_S80M:
            break;
          case PSRAM_CACHE_F80M_S40M:
          case PSRAM_CACHE_F40M_S40M:
          default:
            ps_cmd.cmd_bit_len = 2;
            break;
        }
    }

  ps_cmd.cmd = 0;
  ps_cmd.addr = &addr;
  ps_cmd.addr_bit_len = 8;
  ps_cmd.tx_data = NULL;
  ps_cmd.tx_data_bit_len = 0;
  ps_cmd.rx_data = NULL;
  ps_cmd.rx_data_bit_len = 0;
  ps_cmd.dummy_bit_len = 0;
  psram_cmd_config(spi_num, &ps_cmd);
  psram_cmd_recv_start(spi_num, NULL, 0, PSRAM_CMD_SPI);
  psram_cmd_end(spi_num);
  return OK;
}

#if defined(CONFIG_ESP32_SPIRAM_2T_MODE)
/* use SPI user mode to write psram */

static void spi_user_psram_write(psram_spi_num_t spi_num, uint32_t address,
                                 uint32_t *data_buffer, uint32_t data_len)
{
  uint32_t addr = (PSRAM_QUAD_WRITE << 24) | (address & 0x7fffff);
  psram_cmd_t ps_cmd;
  ps_cmd.cmd_bit_len = 0;
  ps_cmd.cmd = 0;
  ps_cmd.addr = &addr;
  ps_cmd.addr_bit_len = 4 * 8;
  ps_cmd.tx_data_bit_len = 32 * 8;
  ps_cmd.tx_data = NULL;
  ps_cmd.rx_data_bit_len = 0;
  ps_cmd.rx_data = NULL;
  ps_cmd.dummy_bit_len = 0;

  for (uint32_t i = 0; i < data_len; i += 32)
    {
      psram_clear_spi_fifo(spi_num);
      addr = (PSRAM_QUAD_WRITE << 24) | ((address & 0x7fffff) + i);
      ps_cmd.tx_data = data_buffer + (i / 4);
      psram_cmd_config(spi_num, &ps_cmd);
      psram_cmd_recv_start(spi_num, ps_cmd.rx_data,
                           ps_cmd.rx_data_bit_len / 8, PSRAM_CMD_QPI);
    }

  psram_cmd_end(spi_num);
}

