apache/nuttx/arch/xtensa/src/esp32/esp32_psram.c
/* use SPI user mode to read psram */

static void spi_user_psram_read(psram_spi_num_t spi_num, uint32_t address,
                                uint32_t *data_buffer, uint32_t data_len)
{
  uint32_t addr = (PSRAM_FAST_READ_QUAD << 24) | (address & 0x7fffff);
  uint32_t dummy_bits = PSRAM_FAST_READ_QUAD_DUMMY + 1;

  psram_cmd_t ps_cmd;
  ps_cmd.cmd_bit_len = 0;
  ps_cmd.cmd = 0;
  ps_cmd.addr = &addr;
  ps_cmd.addr_bit_len = 4 * 8;
  ps_cmd.tx_data_bit_len = 0;
  ps_cmd.tx_data = NULL;
  ps_cmd.rx_data_bit_len = 32 * 8;
  ps_cmd.dummy_bit_len = dummy_bits + extra_dummy;

  for (uint32_t i = 0; i < data_len; i += 32)
    {
      psram_clear_spi_fifo(spi_num);
      addr = (PSRAM_FAST_READ_QUAD << 24) | ((address & 0x7fffff) + i);
      ps_cmd.rx_data = data_buffer + (i / 4);
      psram_cmd_config(spi_num, &ps_cmd);
      psram_cmd_recv_start(spi_num, ps_cmd.rx_data,
                           ps_cmd.rx_data_bit_len / 8, PSRAM_CMD_QPI);
    }

  psram_cmd_end(spi_num);
}

/* enable psram 2T mode */

static int IRAM_ATTR
psram_2t_mode_enable(psram_spi_num_t spi_num)
{
  psram_disable_qio_mode(spi_num);

  /* configure psram clock as 5 MHz */

  uint32_t div = rtc_clk_apb_freq_get() / 5000000;
  esp_rom_spiflash_config_clk(div, spi_num);

  psram_cmd_t ps_cmd;

  /* setp1: send cmd 0x5e
   *        send one more bit clock after send cmd
   */

  ps_cmd.cmd = 0x5e;
  ps_cmd.cmd_bit_len = 8;
  ps_cmd.addr_bit_len = 0;
  ps_cmd.addr = 0;
  ps_cmd.tx_data_bit_len = 0;
  ps_cmd.tx_data = NULL;
  ps_cmd.rx_data_bit_len = 0;
  ps_cmd.rx_data = NULL;
  ps_cmd.dummy_bit_len = 1;
  psram_cmd_config(spi_num, &ps_cmd);
  psram_clear_spi_fifo(spi_num);
  psram_cmd_recv_start(spi_num, NULL, 0, PSRAM_CMD_SPI);
  psram_cmd_end(spi_num);

  /* setp2: send cmd 0x5f
   *        send one more bit clock after send cmd
   */

  ps_cmd.cmd = 0x5f;
  psram_cmd_config(spi_num, &ps_cmd);
  psram_clear_spi_fifo(spi_num);
  psram_cmd_recv_start(spi_num, NULL, 0, PSRAM_CMD_SPI);
  psram_cmd_end(spi_num);

  /* setp3: keep cs as high level
   *        send 128 cycles clock
   *        send 1 bit high level in ninth clock from the back to PSRAM SIO1
   */

  GPIO_OUTPUT_SET(CONFIG_D0WD_PSRAM_CS_IO, 1);
  esp_gpio_matrix_out(CONFIG_D0WD_PSRAM_CS_IO, SIG_GPIO_OUT_IDX, 0, 0);

  esp_gpio_matrix_out(PSRAM_SPID_SD1_IO, SPIQ_OUT_IDX, 0, 0);
  esp_gpio_matrix_in(PSRAM_SPID_SD1_IO, SPIQ_IN_IDX, 0);
  esp_gpio_matrix_out(PSRAM_SPIQ_SD0_IO, SPID_OUT_IDX, 0, 0);
  esp_gpio_matrix_in(PSRAM_SPIQ_SD0_IO, SPID_IN_IDX, 0);

  uint32_t w_data_2t[4] =
                          {
                            0x0, 0x0, 0x0, 0x00010000
                          };

  ps_cmd.cmd = 0;
  ps_cmd.cmd_bit_len = 0;
  ps_cmd.tx_data_bit_len = 128;
  ps_cmd.tx_data = w_data_2t;
  ps_cmd.dummy_bit_len = 0;
  psram_clear_spi_fifo(spi_num);
  psram_cmd_config(spi_num, &ps_cmd);
  psram_cmd_recv_start(spi_num, NULL, 0, PSRAM_CMD_SPI);
  psram_cmd_end(spi_num);

  esp_gpio_matrix_out(PSRAM_SPIQ_SD0_IO, SPIQ_OUT_IDX, 0, 0);
  esp_gpio_matrix_in(PSRAM_SPIQ_SD0_IO, SPIQ_IN_IDX, 0);
  esp_gpio_matrix_out(PSRAM_SPID_SD1_IO, SPID_OUT_IDX, 0, 0);
  esp_gpio_matrix_in(PSRAM_SPID_SD1_IO, SPID_IN_IDX, 0);

  esp_gpio_matrix_out(CONFIG_D0WD_PSRAM_CS_IO, SPICS1_OUT_IDX, 0, 0);

  /* setp4: send cmd 0x5f
   *        send one more bit clock after send cmd
   */

  ps_cmd.cmd = 0x5f;
  ps_cmd.cmd_bit_len = 8;
  ps_cmd.tx_data_bit_len = 0;
  ps_cmd.tx_data = NULL;
  ps_cmd.dummy_bit_len = 1;
  psram_cmd_config(spi_num, &ps_cmd);
  psram_clear_spi_fifo(spi_num);
  psram_cmd_recv_start(spi_num, NULL, 0, PSRAM_CMD_SPI);
  psram_cmd_end(spi_num);

  /* configure psram clock back to the default value */

  switch (s_psram_mode)
    {
      case PSRAM_CACHE_F80M_S40M:
      case PSRAM_CACHE_F40M_S40M:
        esp_rom_spiflash_config_clk(_SPI_40M_CLK_DIV, spi_num);
        break;
      case PSRAM_CACHE_F80M_S80M:
        esp_rom_spiflash_config_clk(_SPI_80M_CLK_DIV, spi_num);
        break;
      default:
        break;
    }

  psram_enable_qio_mode(spi_num);
  return OK;
}

#define CHECK_DATA_LEN   (1024)
#define CHECK_ADDR_STEP  (0x100000)
#define SIZE_32MBIT      (0x400000)
#define SIZE_64MBIT      (0x800000)

static int psram_2t_mode_check(psram_spi_num_t spi_num)
{
  uint32_t addr;
  uint8_t w_check_data[CHECK_DATA_LEN] =
                                          {
                                            0
                                          };

  uint8_t r_check_data[CHECK_DATA_LEN] =
                                          {
                                            0
                                          };

  for (uint32_t addr = 0; addr < SIZE_32MBIT; addr += CHECK_ADDR_STEP)
    {
      spi_user_psram_write(spi_num, addr, (uint32_t *)w_check_data,
                           CHECK_DATA_LEN);
    }

  memset(w_check_data, 0xff, sizeof(w_check_data));

  for (addr = SIZE_32MBIT; addr < SIZE_64MBIT; addr += CHECK_ADDR_STEP)
    {
      spi_user_psram_write(spi_num, addr, (uint32_t *)w_check_data,
                           CHECK_DATA_LEN);
    }

  for (uint32_t addr = 0; addr < SIZE_32MBIT; addr += CHECK_ADDR_STEP)
    {
      spi_user_psram_read(spi_num, addr, (uint32_t *)r_check_data,
                          CHECK_DATA_LEN);
      for (uint32_t j = 0; j < CHECK_DATA_LEN; j++)
        {
          if (r_check_data[j] != 0xff)
            {
              return -EFAULT;
            }
        }
    }

  return ESP_OK;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

void psram_set_cs_timing(psram_spi_num_t spi_num, psram_clk_mode_t clk_mode)
{
  if (clk_mode == PSRAM_CLK_MODE_NORM)
    {
      modifyreg32(SPI_USER_REG(spi_num), 0, SPI_CS_HOLD_M | SPI_CS_SETUP_M);

      /* Set cs time. */

      SET_PERI_REG_BITS(SPI_CTRL2_REG(spi_num), SPI_HOLD_TIME_V,
                        PSRAM_CS_HOLD_TIME, SPI_HOLD_TIME_S);
      SET_PERI_REG_BITS(SPI_CTRL2_REG(spi_num), SPI_SETUP_TIME_V, 0,
                        SPI_SETUP_TIME_S);
    }
  else
    {
      modifyreg32(SPI_USER_REG(spi_num),
                          SPI_CS_HOLD_M | SPI_CS_SETUP_M, 0);
    }
}

/* spi param init for psram */

void IRAM_ATTR
psram_spi_init(psram_spi_num_t spi_num, int mode)
{
  modifyreg32(SPI_SLAVE_REG(spi_num), SPI_TRANS_DONE << 5, 0);

  /* SPI_CPOL & SPI_CPHA */

