apache/nuttx/arch/xtensa/src/esp32/esp32_psram.c
  modifyreg32(SPI_PIN_REG(spi_num), SPI_CK_IDLE_EDGE, 0);
  modifyreg32(SPI_USER_REG(spi_num), SPI_CK_OUT_EDGE, 0);

  /* SPI bit order */

  modifyreg32(SPI_CTRL_REG(spi_num), SPI_WR_BIT_ORDER, 0);
  modifyreg32(SPI_CTRL_REG(spi_num), SPI_RD_BIT_ORDER, 0);

  /* SPI bit order */

  modifyreg32(SPI_USER_REG(spi_num), SPI_DOUTDIN, 0);

  /* May be not must to do. */

  putreg32(0, SPI_USER1_REG(spi_num));

  /* SPI mode type */

  modifyreg32(SPI_SLAVE_REG(spi_num), SPI_SLAVE_MODE, 0);
  memset((void *)SPI_W0_REG(spi_num), 0, 16 * 4);
  psram_set_cs_timing(spi_num, s_clk_mode);
}

/* psram gpio init , different working frequency we have different
 * solutions
 */

static void IRAM_ATTR psram_gpio_config(psram_io_t *psram_io,
                                        int mode)
{
  int spi_cache_dummy = 0;
  uint32_t rd_mode_reg = getreg32(SPI_CTRL_REG(0));

  if (rd_mode_reg & SPI_FREAD_QIO_M)
    {
      spi_cache_dummy = SPI0_R_QIO_DUMMY_CYCLELEN;
    }
  else
    {
      if (rd_mode_reg & SPI_FREAD_DIO_M)
        {
          spi_cache_dummy = SPI0_R_DIO_DUMMY_CYCLELEN;
          SET_PERI_REG_BITS(SPI_USER1_REG(0), SPI_USR_ADDR_BITLEN_V,
                          SPI0_R_DIO_ADDR_BITSLEN, SPI_USR_ADDR_BITLEN_S);
        }
      else
        {
          if (rd_mode_reg & (SPI_FREAD_QUAD_M | SPI_FREAD_DUAL_M))
            {
              spi_cache_dummy = SPI0_R_FAST_DUMMY_CYCLELEN;
            }
          else
            {
              spi_cache_dummy = SPI0_R_FAST_DUMMY_CYCLELEN;
            }
        }
    }

  switch (mode)
    {
      case PSRAM_CACHE_F80M_S40M:
        extra_dummy = PSRAM_IO_MATRIX_DUMMY_40M;
        g_rom_spiflash_dummy_len_plus[_SPI_CACHE_PORT] =
                                     PSRAM_IO_MATRIX_DUMMY_80M;
        g_rom_spiflash_dummy_len_plus[_SPI_FLASH_PORT] =
                                     PSRAM_IO_MATRIX_DUMMY_40M;
        SET_PERI_REG_BITS(SPI_USER1_REG(_SPI_CACHE_PORT),
                          SPI_USR_DUMMY_CYCLELEN_V,
                          spi_cache_dummy + PSRAM_IO_MATRIX_DUMMY_80M,
                          SPI_USR_DUMMY_CYCLELEN_S);  /* DUMMY */
        esp_rom_spiflash_config_clk(_SPI_80M_CLK_DIV, _SPI_CACHE_PORT);
        esp_rom_spiflash_config_clk(_SPI_40M_CLK_DIV, _SPI_FLASH_PORT);
        break;

      case PSRAM_CACHE_F80M_S80M:
        extra_dummy = PSRAM_IO_MATRIX_DUMMY_80M;
        g_rom_spiflash_dummy_len_plus[_SPI_CACHE_PORT] =
                                     PSRAM_IO_MATRIX_DUMMY_80M;
        g_rom_spiflash_dummy_len_plus[_SPI_FLASH_PORT] =
                                     PSRAM_IO_MATRIX_DUMMY_80M;
        SET_PERI_REG_BITS(SPI_USER1_REG(_SPI_CACHE_PORT),
                          SPI_USR_DUMMY_CYCLELEN_V,
                          spi_cache_dummy + PSRAM_IO_MATRIX_DUMMY_80M,
                          SPI_USR_DUMMY_CYCLELEN_S);  /* DUMMY */
        esp_rom_spiflash_config_clk(_SPI_80M_CLK_DIV, _SPI_CACHE_PORT);
        esp_rom_spiflash_config_clk(_SPI_80M_CLK_DIV, _SPI_FLASH_PORT);
        break;

      case PSRAM_CACHE_F40M_S40M:
        extra_dummy = PSRAM_IO_MATRIX_DUMMY_40M;
        g_rom_spiflash_dummy_len_plus[_SPI_CACHE_PORT] =
                                     PSRAM_IO_MATRIX_DUMMY_40M;
        g_rom_spiflash_dummy_len_plus[_SPI_FLASH_PORT] =
                                     PSRAM_IO_MATRIX_DUMMY_40M;
        SET_PERI_REG_BITS(SPI_USER1_REG(_SPI_CACHE_PORT),
                          SPI_USR_DUMMY_CYCLELEN_V,
                          spi_cache_dummy + PSRAM_IO_MATRIX_DUMMY_40M,
                          SPI_USR_DUMMY_CYCLELEN_S);  /* DUMMY */
        esp_rom_spiflash_config_clk(_SPI_40M_CLK_DIV, _SPI_CACHE_PORT);
        esp_rom_spiflash_config_clk(_SPI_40M_CLK_DIV, _SPI_FLASH_PORT);

        break;

      default:
        break;
    }

  SET_PERI_REG_MASK(SPI_USER_REG(0), SPI_USR_DUMMY); /* dummy enable */

  /* In bootloader, all the signals are already configured */

  /* We keep the following code in case the bootloader is some older
   * version.
   */

  esp_gpio_matrix_out(psram_io->flash_cs_io, SPICS0_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(psram_io->psram_cs_io, SPICS1_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(psram_io->psram_spiq_sd0_io, SPIQ_OUT_IDX, 0, 0);
  esp_gpio_matrix_in(psram_io->psram_spiq_sd0_io, SPIQ_IN_IDX, 0);
  esp_gpio_matrix_out(psram_io->psram_spid_sd1_io, SPID_OUT_IDX, 0, 0);
  esp_gpio_matrix_in(psram_io->psram_spid_sd1_io, SPID_IN_IDX, 0);
  esp_gpio_matrix_out(psram_io->psram_spiwp_sd3_io, SPIWP_OUT_IDX, 0, 0);
  esp_gpio_matrix_in(psram_io->psram_spiwp_sd3_io, SPIWP_IN_IDX, 0);
  esp_gpio_matrix_out(psram_io->psram_spihd_sd2_io, SPIHD_OUT_IDX, 0, 0);
  esp_gpio_matrix_in(psram_io->psram_spihd_sd2_io, SPIHD_IN_IDX, 0);

  /* select pin function gpio */

  if ((psram_io->flash_clk_io == SPI_IOMUX_PIN_NUM_CLK) &&
      (psram_io->flash_clk_io != psram_io->psram_clk_io))
    {
      /* flash clock signal should come from IO MUX. */

      esp_configgpio(psram_io->flash_clk_io, OUTPUT_FUNCTION_2);
    }
  else
    {
      /* flash clock signal should come from GPIO matrix. */

      esp_configgpio(psram_io->flash_clk_io, OUTPUT_FUNCTION_3);
    }

  esp_configgpio(psram_io->flash_cs_io, OUTPUT | FUNCTION_3);
  esp_configgpio(psram_io->psram_cs_io, OUTPUT | FUNCTION_3);
  esp_configgpio(psram_io->psram_clk_io, OUTPUT | FUNCTION_3);
  esp_configgpio(psram_io->psram_spiq_sd0_io, OUTPUT | INPUT | FUNCTION_3);
  esp_configgpio(psram_io->psram_spid_sd1_io, OUTPUT | INPUT | FUNCTION_3);
  esp_configgpio(psram_io->psram_spihd_sd2_io,
                   OUTPUT | INPUT | FUNCTION_3);
  esp_configgpio(psram_io->psram_spiwp_sd3_io,
                   OUTPUT | INPUT | FUNCTION_3);

#if 0
  uint32_t flash_id = g_rom_flashchip.device_id;
  if (flash_id == FLASH_ID_GD25LQ32C)
    {
      /* Set drive ability for 1.8v flash in 80Mhz. */

      SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->flash_cs_io], FUN_DRV_V,
                        3, FUN_DRV_S);
      SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->flash_clk_io], FUN_DRV_V,
                        3, FUN_DRV_S);
      SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_cs_io], FUN_DRV_V,
                        3, FUN_DRV_S);
      SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_clk_io], FUN_DRV_V,
                        3, FUN_DRV_S);
      SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_spiq_sd0_io],
                        FUN_DRV_V, 3, FUN_DRV_S);
      SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_spid_sd1_io],
                        FUN_DRV_V, 3, FUN_DRV_S);
      SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_spihd_sd2_io],
                        FUN_DRV_V, 3, FUN_DRV_S);
      SET_PERI_REG_BITS(GPIO_PIN_MUX_REG[psram_io->psram_spiwp_sd3_io],
                        FUN_DRV_V, 3, FUN_DRV_S);
    }
#endif
}

int psram_get_size(void)
{
  if ((PSRAM_SIZE_ID(s_psram_id) == PSRAM_EID_SIZE_64MBITS) ||
      PSRAM_IS_64MBIT_TRIAL(s_psram_id))
    {
      return s_2t_mode_enabled ? PSRAM_SIZE_32MBITS : PSRAM_SIZE_64MBITS;
    }
  else
    {
      if (PSRAM_SIZE_ID(s_psram_id) == PSRAM_EID_SIZE_32MBITS)
        {
          return PSRAM_SIZE_32MBITS;
        }
      else
        {
          if (PSRAM_SIZE_ID(s_psram_id) == PSRAM_EID_SIZE_16MBITS)
            {
              return PSRAM_SIZE_16MBITS;
            }
          else
            {
              return PSRAM_SIZE_MAX;
            }
        }
    }
}

/* used in UT only */

bool psram_is_32mbit_ver0(void)
{
  return PSRAM_IS_32MBIT_VER0(s_psram_id);
}

/* PSRAM mode init will overwrite original flash speed mode, so that it is
 * possible to change psram and flash speed after OTA.
 * Flash read mode(QIO/QOUT/DIO/DOUT) will not be changed in app bin.
 * It is decided by bootloader, OTA can not change this mode.
 */

int IRAM_ATTR
psram_enable(int mode, int vaddrmode)   /* psram init */
{
  struct rtc_vddsdio_config_s cfg;

  /* Let's assume we are not worrying about OTA issue and ignore for now */

  psram_io_t psram_io =
                        {
                          0
                        };

  uint32_t chip_ver = (REG_GET_FIELD(EFUSE_BLK0_RDATA3_REG,
                                    EFUSE_RD_CHIP_PACKAGE_4BIT) << 3) |
                      REG_GET_FIELD(EFUSE_BLK0_RDATA3_REG,
                                    EFUSE_RD_CHIP_PACKAGE);
  uint32_t pkg_ver = chip_ver & 0x7;
  uint32_t spiconfig;

  if (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32D2WDQ5)
    {
      minfo("This chip is ESP32-D2WD\n");

      esp32_get_vddsdio_config(&cfg);
      if (cfg.tieh != RTC_VDDSDIO_TIEH_1_8V)
        {
          merr("VDDSDIO is not 1.8V");
          return -EFAULT;
        }

      psram_io.psram_clk_io = CONFIG_D2WD_PSRAM_CLK_IO;
      psram_io.psram_cs_io  = CONFIG_D2WD_PSRAM_CS_IO;
    }
  else
    {
      if ((pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32PICOD2) ||
          (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32PICOD4))
        {
          minfo("This chip is ESP32-PICO");

          esp32_get_vddsdio_config(&cfg);
          if (cfg.tieh != RTC_VDDSDIO_TIEH_3_3V)
            {
              merr("VDDSDIO is not 3.3V");
              return -EFAULT;
            }

