apache/nuttx/arch/xtensa/src/esp32/esp32_psram.c
          s_clk_mode = PSRAM_CLK_MODE_NORM;
          psram_io.psram_clk_io = PICO_PSRAM_CLK_IO;
          psram_io.psram_cs_io  = CONFIG_PICO_PSRAM_CS_IO;
        }
      else
        {
          if ((pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32D0WDQ6) ||
              (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32D0WDQ5))
            {
              minfo("This chip is ESP32-D0WD\n");
              psram_io.psram_clk_io = CONFIG_D0WD_PSRAM_CLK_IO;
              psram_io.psram_cs_io  = CONFIG_D0WD_PSRAM_CS_IO;
            }
          else
            {
              merr("Not a valid or known package id: %" PRIu32 "", pkg_ver);
              PANIC();
            }
        }
    }

  spiconfig = ets_efuse_get_spiconfig();
  if (spiconfig == EFUSE_SPICFG_SPI_DEFAULTS)
    {
      minfo("SPI Defaults\n");
      psram_io.flash_clk_io       = SPI_IOMUX_PIN_NUM_CLK;
      psram_io.flash_cs_io        = SPI_IOMUX_PIN_NUM_CS;
      psram_io.psram_spiq_sd0_io  = PSRAM_SPIQ_SD0_IO;
      psram_io.psram_spid_sd1_io  = PSRAM_SPID_SD1_IO;
      psram_io.psram_spiwp_sd3_io = PSRAM_SPIWP_SD3_IO;
      psram_io.psram_spihd_sd2_io = PSRAM_SPIHD_SD2_IO;
    }
  else
    {
      if (spiconfig == EFUSE_SPICFG_HSPI_DEFAULTS)
        {
          minfo("HSPI Defaults\n");
          psram_io.flash_clk_io       = FLASH_HSPI_CLK_IO;
          psram_io.flash_cs_io        = FLASH_HSPI_CS_IO;
          psram_io.psram_spiq_sd0_io  = PSRAM_HSPI_SPIQ_SD0_IO;
          psram_io.psram_spid_sd1_io  = PSRAM_HSPI_SPID_SD1_IO;
          psram_io.psram_spiwp_sd3_io = PSRAM_HSPI_SPIWP_SD3_IO;
          psram_io.psram_spihd_sd2_io = PSRAM_HSPI_SPIHD_SD2_IO;
        }
      else
        {
          minfo("SPI EFUSE Config\n");
          psram_io.flash_clk_io       = EFUSE_SPICFG_RET_SPICLK(spiconfig);
          psram_io.flash_cs_io        = EFUSE_SPICFG_RET_SPICS0(spiconfig);
          psram_io.psram_spiq_sd0_io  = EFUSE_SPICFG_RET_SPIQ(spiconfig);
          psram_io.psram_spid_sd1_io  = EFUSE_SPICFG_RET_SPID(spiconfig);
          psram_io.psram_spihd_sd2_io = EFUSE_SPICFG_RET_SPIHD(spiconfig);

          /* If flash mode is set to QIO or QOUT, the WP pin is equal the
           * value configured in bootloader. If flash mode is set to DIO or
           * DOUT, the WP pin should config it via menuconfig.
           */

          /* Since the default value is the same from the bootloader
           * Let's use it for now.
           */

          psram_io.psram_spiwp_sd3_io = CONFIG_ESP32_SPIRAM_SPIWP_SD3_PIN;
        }
    }

  ASSERT(mode < PSRAM_CACHE_MAX && "we don't support any other mode.");
  s_psram_mode = mode;

  putreg32(0x1, SPI_EXT3_REG(0));
  modifyreg32(SPI_USER_REG(PSRAM_SPI_1), SPI_USR_PREP_HOLD_M, 0);

  psram_spi_init(PSRAM_SPI_1, mode);

  switch (mode)
    {
      case PSRAM_CACHE_F80M_S80M:
        esp_gpio_matrix_out(psram_io.psram_clk_io, SPICLK_OUT_IDX, 0, 0);
        break;
      case PSRAM_CACHE_F80M_S40M:
      case PSRAM_CACHE_F40M_S40M:
      default:
        if (s_clk_mode == PSRAM_CLK_MODE_DCLK)
          {
            /* We need to delay CLK to the PSRAM with respect to the clock
             * signal as output by the SPI peripheral. We do this by routing
             * it signal to signal 224/225, which are used as a loopback; the
             * extra run through the GPIO matrix causes the delay. We use
             * GPIO20 (which is not in any package but has pad logic in
             * silicon) as a temporary pad for this. So the signal path is:
             * SPI CLK --> GPIO28 --> signal224(in then out) -->
             * internal GPIO29 --> signal225(in then out) -->
             * GPIO17(PSRAM CLK)
             */

            minfo("clk_mode == PSRAM_CLK_MODE_DCLK\n");
            esp_gpio_matrix_out(PSRAM_INTERNAL_IO_28,
                                  SPICLK_OUT_IDX, 0, 0);
            esp_gpio_matrix_in(PSRAM_INTERNAL_IO_28,
                                 SIG_IN_FUNC224_IDX, 0);
            esp_gpio_matrix_out(PSRAM_INTERNAL_IO_29,
                                  SIG_IN_FUNC224_IDX, 0, 0);
            esp_gpio_matrix_in(PSRAM_INTERNAL_IO_29,
                                 SIG_IN_FUNC225_IDX, 0);
            esp_gpio_matrix_out(psram_io.psram_clk_io,
                                  SIG_IN_FUNC225_IDX, 0, 0);
          }
        else
          {
            minfo("clk_io == OUT_IDX\n");
            esp_gpio_matrix_out(psram_io.psram_clk_io,
                                  SPICLK_OUT_IDX, 0, 0);
          }
        break;
    }

  /* Rise VDDSIO for 1.8V psram. */

  /* bootloader_common_vddsdio_configure(); */

  /* GPIO related settings */

  psram_gpio_config(&psram_io, mode);
  psram_read_id(&s_psram_id);

  minfo("psram ID = 0x%" PRIx32 "\n", (uint32_t)s_psram_id);

  if (!PSRAM_IS_VALID(s_psram_id))
    {
      minfo("PSRAM ID NOT VALID\n");
      return -ENODEV;
    }

  if (psram_is_32mbit_ver0())
    {
      s_clk_mode = PSRAM_CLK_MODE_DCLK;
      if (mode == PSRAM_CACHE_F80M_S80M)
        {
#ifdef CONFIG_ESP32_SPIRAM_OCCUPY_NO_HOST
          merr("This version of PSRAM needs to claim an extra SPI"
               "peripheral at 80MHz. Please either: choose lower"
               "frequency by SPIRAM_SPEED_, or select one SPI peripheral"
               "it by SPIRAM_OCCUPY_*SPI_HOST in the menuconfig.");
          abort();
#else
          /* note: If the third mode(80Mhz+80Mhz) is enabled for 32MBit 1V8
           * psram, one of HSPI/VSPI port will be occupied by the system
           * (according to kconfig). Application code should never touch
           * HSPI/VSPI hardware in this case.  We try to stop applications
           * from doing this using the drivers by claiming the port for
           * ourselves
           */

          esp_gpio_matrix_out(psram_io.psram_clk_io,
                                PSRAM_CLK_SIGNAL, 0, 0);

          /* use spi3 clock,but use spi1 data/cs wires
           * We get a solid 80MHz clock from SPI3 by setting it up, starting
           * a transaction, waiting until it is in progress, then cutting the
           * clock (but not the reset!) to that peripheral.
           */

          putreg32(32 << 24, SPI_ADDR_REG(PSRAM_SPI_NUM));
          modifyreg32(SPI_CMD_REG(PSRAM_SPI_NUM), 0, SPI_FLASH_READ_M);
          uint32_t spi_status;
          while (1)
            {
              spi_status = getreg32(SPI_EXT2_REG(PSRAM_SPI_NUM));
              if (spi_status != 0 && spi_status != 1)
                {
                  modifyreg32(DPORT_PERIP_CLK_EN_REG, DPORT_SPI_CLK_EN_1, 0);
                  break;
                }
            }
#endif
        }
    }
  else
    {
      /* For other psram, we don't need any extra clock cycles after cs get
       * back to high level
       */

      s_clk_mode = PSRAM_CLK_MODE_NORM;
      esp_gpio_matrix_out(PSRAM_INTERNAL_IO_28, SIG_GPIO_OUT_IDX, 0, 0);
      esp_gpio_matrix_out(PSRAM_INTERNAL_IO_29, SIG_GPIO_OUT_IDX, 0, 0);
      esp_gpio_matrix_out(psram_io.psram_clk_io, SPICLK_OUT_IDX, 0, 0);
    }

  /* Update cs timing according to psram driving method. */

  psram_set_cs_timing(PSRAM_SPI_1, s_clk_mode);
  psram_set_cs_timing(_SPI_CACHE_PORT, s_clk_mode);
  psram_enable_qio_mode(PSRAM_SPI_1);

  if (((PSRAM_SIZE_ID(s_psram_id) == PSRAM_EID_SIZE_64MBITS) ||
        PSRAM_IS_64MBIT_TRIAL(s_psram_id)))
    {
#if defined(CONFIG_ESP32_SPIRAM_2T_MODE)
#  if CONFIG_ESP32_SPIRAM_BANKSWITCH_ENABLE
      merr("PSRAM 2T mode and SPIRAM bank switching can not enabled\
            meanwhile. Please read the help text for SPIRAM_2T_MODE in the\
            project configuration menu.");
      abort();
#  endif
      /* Note: 2T mode command should not be sent twice,
       * otherwise psram would get back to normal mode.
       */

      if (psram_2t_mode_check(PSRAM_SPI_1) != OK)
        {
          psram_2t_mode_enable(PSRAM_SPI_1);
          if (psram_2t_mode_check(PSRAM_SPI_1) != OK)
            {
              merr("PSRAM 2T mode enable fail!\n");
              return -EINVAL;
            }
        }

      s_2t_mode_enabled = true;
      minfo("PSRAM is in 2T mode");
#endif
    }

  psram_cache_init(mode, vaddrmode);

  return OK;
}

#endif /* CONFIG_ESP32_SPIRAM */
